Repository: Maneox/List-IQ
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Last update:
fr: Dernière mise à jour :

source: IP Restricted
fr: Restreint par IP

source: View
fr: Consulter

source: Export
fr: Exporter

source: Settings
fr: Paramètres

source: Update data
fr: Mettre à jour les données

source: CSV Configuration
fr: Configuration CSV

source: Add a row
fr: Ajouter une ligne

source: Select a date
fr: Sélectionner une date

source: e.g.: 192.168.1.1 or 192.168.1.0/24
fr: ex: 192.168.1.1 ou 192.168.1.0/24

source: Accepted format: IPv4 (e.g., 192.168.1.1 or 192.168.1.0/24) or IPv6 (e.g., 2001:db8::1 or 2001:db8::/64)
fr: Format accepté : IPv4 (ex: 192.168.1.1 ou 192.168.1.0/24) ou IPv6 (ex: 2001:db8::1 ou 2001:db8::/64)

source: Edit a row
fr: Modifier une ligne

source: Import data
fr: Importer des données

source: File to import
fr: Fichier à importer

source: The file (CSV or JSON) must have the following columns:
fr: Le fichier (CSV ou JSON) doit comporter les colonnes suivantes :

source: Accepted formats:
fr: Formats acceptés :

source: file with column headers and comma-separated values
fr: fichier avec en-têtes de colonnes et valeurs séparées par des virgules

source: list of objects with column names as keys
fr: liste d'objets avec les noms des colonnes comme clés

source: Update in progress...
fr: Mise à jour en cours...

source: Execution logs
fr: Journaux d'exécution

source: Starting update...
fr: Démarrage de la mise à jour...

source: Data updated successfully
fr: Données mises à jour avec succès

source: Reload page to see changes
fr: Rechargez la page pour voir les changements

source: Error updating data
fr: Erreur lors de la mise à jour des données

source: Error communicating with server
fr: Erreur de communication avec le serveur
