Repository: Maneox/List-IQ
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Enter your script in the "Script Code" field
fr: Entrez votre script dans le champ "Code du script"

source: Select the script language (Python, JavaScript, etc.)
fr: Sélectionnez le langage du script (Python, JavaScript, etc.)

source: Configure the update schedule (cron format)
fr: Configurez la planification de la mise à jour (format cron)

source: Python Script Format
fr: Format du script Python

source: Important points:
fr: Points importants :

source: The script must print the data in JSON format
fr: Le script doit imprimer les données au format JSON

source: The data must match the columns defined in the list
fr: Les données doivent correspondre aux colonnes définies dans la liste

source: You can use standard Python modules and those installed in the environment (requests, pandas, etc.)
fr: Vous pouvez utiliser les modules Python standard et ceux installés dans l'environnement (requests, pandas, etc.)

source: This method allows you to use a curl command to retrieve data from an API.
fr: Cette méthode vous permet d'utiliser une commande curl pour récupérer des données depuis une API.

source: In "API Type", select "Curl"
fr: Dans "Type d'API", sélectionnez "Curl"

source: Enter your curl command in the designated field
fr: Entrez votre commande curl dans le champ désigné

source: Example curl command
fr: Exemple de commande curl

source: The curl command must return data in JSON format
fr: La commande curl doit retourner des données au format JSON

source: Make sure to include necessary authentication headers if required
fr: Assurez-vous d'inclure les en-têtes d'authentification nécessaires si requis

source: This method allows you to directly retrieve data from a URL that returns JSON or CSV.
fr: Cette méthode vous permet de récupérer directement des données depuis une URL qui renvoie du JSON ou du CSV.

source: In "Data Source", select "Remote URL"
fr: Dans "Source de données", sélectionnez "URL distante"

source: Enter the URL in the designated field
fr: Entrez l'URL dans le champ désigné

source: Select the data format (JSON or CSV)
fr: Sélectionnez le format des données (JSON ou CSV)

source: If necessary, configure authentication settings
fr: Si nécessaire, configurez les paramètres d'authentification

source: The URL must be accessible from the server where the application is hosted
fr: L'URL doit être accessible depuis le serveur où l'application est hébergée

source: For JSON data, the structure must be an array of objects
fr: Pour les données JSON, la structure doit être un tableau d'objets

source: For CSV data, the first row must contain the column names
fr: Pour les données CSV, la première ligne doit contenir les noms des colonnes

source: You can configure the update frequency for automatic lists using cron syntax.
fr: Vous pouvez configurer la fréquence de mise à jour des listes automatiques en utilisant la syntaxe cron.

source: Schedule Examples
fr: Exemples de planification

source: Cron Expression
fr: Expression Cron

source: Every hour (at minute 0)
fr: Toutes les heures (à la minute 0)

source: Every day at midnight
fr: Tous les jours à minuit

source: Monday to Friday at 8:00 AM
fr: Du lundi au vendredi à 8h00

source: On the first day of each month at midnight
fr: Le premier jour de chaque mois à minuit

source: Every 15 minutes
fr: Toutes les 15 minutes

source: Cron syntax consists of 5 fields: minute (0-59), hour (0-23), day of month (1-31), month (1-12), day of week (0-6, where 0 is Sunday).
fr: La syntaxe Cron se compose de 5 champs : minute (0-59), heure (0-23), jour du mois (1-31), mois (1-12), jour de la semaine (0-6, où 0 est dimanche).

source: Help - Curl Commands for APIs
fr: Aide - Commandes Curl pour les API

source: Guide for Curl Commands for APIs
fr: Guide des commandes Curl pour les API

source: This page provides examples and best practices for creating Curl commands that retrieve data from APIs.
fr: Cette page fournit des exemples et des bonnes pratiques pour créer des commandes Curl qui récupèrent des données depuis des API.

source: Basic Structure
fr: Structure de base

source: Simple REST API
fr: API REST simple

source: API with Authentication Key
fr: API avec clé d'authentification

source: Custom Headers
fr: En-têtes personnalisés

source: Sending Data (POST)
fr: Envoi de données (POST)

source: Error Handling
fr: Gestion des erreurs

source: Advanced Examples
fr: Exemples avancés

source: Basic Structure of a Curl Command
fr: Structure de base d'une commande Curl

source: Here is the basic structure of a Curl command to retrieve data from an API:
fr: Voici la structure de base d'une commande Curl pour récupérer des données depuis une API :

source: The Curl command must return data in JSON format for the application to process it correctly.
fr: La commande Curl doit retourner des données au format JSON pour que l'application puisse les traiter correctement.

source: Common options:
fr: Options courantes :

source: Specifies the HTTP method (GET, POST, PUT, DELETE, etc.)
fr: Spécifie la méthode HTTP (GET, POST, PUT, DELETE, etc.)

source: Adds a header to the request
fr: Ajoute un en-tête à la requête

source: Sends data in the request body
fr: Envoie des données dans le corps de la requête

source: Writes the output to a file
fr: Écrit la sortie dans un fichier

source: Silent mode (does not show the progress bar)
fr: Mode silencieux (n'affiche pas la barre de progression)

source: Verbose mode (displays detailed information)
fr: Mode verbeux (affiche des informations détaillées)

source: Example with a Simple REST API
fr: Exemple avec une API REST simple

source: Example of a Curl command to retrieve data from the JSONPlaceholder API:
fr: Exemple de commande Curl pour récupérer des données de l'API JSONPlaceholder :

source: To retrieve a specific item:
fr: Pour récupérer un élément spécifique :

source: To filter results with query parameters:
fr: Pour filtrer les résultats avec des paramètres de requête :

source: Example of a Curl command for an API requiring an API key (like OpenWeatherMap):
fr: Exemple de commande Curl pour une API nécessitant une clé API (comme OpenWeatherMap) :

source: your_api_key
fr: votre_cle_api

source: With the API key in the header:
fr: Avec la clé API dans l'en-tête :

source: With token authentication (Bearer Token):
fr: Avec authentification par jeton (Bearer Token) :

source: your_access_token
fr: votre_jeton_acces

source: Example of a Curl command with custom headers:
fr: Exemple de commande Curl avec des en-têtes personnalisés :

source: Common headers:
fr: En-têtes courants :

source: Type of content sent (e.g., application/json)
fr: Type de contenu envoyé (ex: application/json)

source: Type of content accepted in response
fr: Type de contenu accepté en réponse

source: Authentication information
fr: Informations d'authentification

source: Application identifier
fr: Identifiant de l'application

source: Example of a Curl command to send data in JSON format:
fr: Exemple de commande Curl pour envoyer des données au format JSON :

source: With form data:
fr: Avec des données de formulaire :

source: With a JSON file:
fr: Avec un fichier JSON :

source: To display HTTP status codes:
fr: Pour afficher les codes de statut HTTP :

source: To display the headers and body of the response:
fr: Pour afficher les en-têtes et le corps de la réponse :

source: To display detailed information about the request and response:
fr: Pour afficher des informations détaillées sur la requête et la réponse :

source: To follow redirects:
fr: Pour suivre les redirections :

source: API with OAuth Authentication
fr: API avec authentification OAuth

source: API with Token Authentication
fr: API avec authentification par jeton

source: Step 1: Get the authentication token
fr: Étape 1 : Obtenir le jeton d'authentification

source: your_username
fr: votre_nom_utilisateur

source: your_password
fr: votre_mot_de_passe

source: Step 2: Use the token to access data
fr: Étape 2 : Utiliser le jeton pour accéder aux données

source: API with Pagination
fr: API avec pagination

source: Get the first page
fr: Obtenir la première page

source: Get the next page
fr: Obtenir la page suivante

source: API with Filtering and Sorting
fr: API avec filtrage et tri

source: API with Timeout
fr: API avec timeout

source: Help - JSON Configuration
fr: Aide - Configuration JSON

source: JSON Configuration Guide for APIs
fr: Guide de configuration JSON pour les API

source: This page explains how to configure JSON data processing in the List-IQ application.
fr: Cette page explique comment configurer le traitement des données JSON dans l'application List-IQ.

source: JSON Basics
fr: Bases du JSON

source: Data Path
fr: Chemin des données

source: Column Selection
fr: Sélection des colonnes

source: Data Types
fr: Types de données

source: Common JSON Structures
fr: Structures JSON courantes

source: Practical Examples
fr: Exemples pratiques

source: JSON (JavaScript Object Notation) is a lightweight data format used for data exchange. Here are the basic elements:
fr: JSON (JavaScript Object Notation) est un format de données léger utilisé pour l'échange de données. Voici les éléments de base :

source: Objects
fr: Objets

source: collections of key/value pairs enclosed in curly braces <code>{ }</code>
fr: collections de paires clé/valeur entourées d'accolades <code>{ }</code>

source: Arrays
fr: Tableaux

source: ordered collections of values enclosed in square brackets <code>[ ]</code>
fr: collections ordonnées de valeurs entourées de crochets <code>[ ]</code>

source: Values
fr: Valeurs

source: can be strings, numbers, booleans, null, objects, or arrays
fr: peuvent être des chaînes de caractères, des nombres, des booléens, null, des objets ou des tableaux

source: Example JSON structure:
fr: Exemple de structure JSON :

source: The data path allows you to specify where the relevant data is located in the JSON response. In the List-IQ application, you use dot notation to access nested objects.
fr: Le chemin des données vous permet de spécifier où se trouvent les données pertinentes dans la réponse JSON. Dans l'application List-IQ, vous utilisez la notation par points pour accéder aux objets imbriqués.

source: Path Examples
fr: Exemples de chemin

source: Path
fr: Chemin

source: Example JSON
fr: Exemple JSON

source: Accesses the "data" property at the root
fr: Accède à la propriété "data" à la racine

source: Accesses the "items" property within the "data" object
fr: Accède à la propriété "items" dans l'objet "data"

source: Accesses the "results" property at the root
fr: Accède à la propriété "results" à la racine

source: Accesses "items" in "body" in "response"
fr: Accède à "items" dans "body" dans "response"

source: The path must point to an array of objects. If the response contains a single object, the application will automatically convert it to an array.
fr: Le chemin doit pointer vers un tableau d'objets. Si la réponse contient un seul objet, l'application le convertira automatiquement en tableau.

source: After specifying the data path, you can select the columns (properties) you want to include in your list.
fr: Après avoir spécifié le chemin des données, vous pouvez sélectionner les colonnes (propriétés) que vous souhaitez inclure dans votre liste.

source: Example
fr: Exemple

source: If your JSON looks like this:
fr: Si votre JSON ressemble à ceci :

source: You could select the following columns:
fr: Vous pourriez sélectionner les colonnes suivantes :

source: type: number
fr: type : nombre

source: type: text
fr: type : texte

source: The application automatically extracts these properties from each object in the array.
fr: L'application extrait automatiquement ces propriétés de chaque objet du tableau.

source: Tip:
fr: Astuce :

source: For nested properties, use dot notation (e.g., <code>author.name</code>).
fr: Pour les propriétés imbriquées, utilisez la notation par points (ex: <code>author.name</code>).

source: The List-IQ application supports several data types for columns:
fr: L'application List-IQ prend en charge plusieurs types de données pour les colonnes :

source: Text
fr: Texte

source: Strings of characters
fr: Chaînes de caractères

source: Number
fr: Nombre

source: Numeric values (integers or decimals)
fr: Valeurs numériques (entiers ou décimaux)

source: Dates in ISO format or similar
fr: Dates au format ISO ou similaire

source: IP Address
fr: Adresse IP

source: IPv4 or IPv6 addresses
fr: Adresses IPv4 ou IPv6

source: The application attempts to automatically detect the data type, but you can change it manually if necessary.
fr: L'application tente de détecter automatiquement le type de données, mais vous pouvez le modifier manuellement si nécessaire.

source: Root-level array of objects
fr: Tableau d'objets à la racine

source: Data Path:
fr: Chemin des données :

source: Leave empty (or simply use <code>.</code>)
fr: Laisser vide (ou utiliser simplement <code>.</code>)

source: Property containing an array of objects
fr: Propriété contenant un tableau d'objets

source: Nested structure with pagination
fr: Structure imbriquée avec pagination

source: Example 1: JSONPlaceholder API
fr: Exemple 1 : API JSONPlaceholder

source: Curl command:
fr: Commande Curl :

source: JSON response (excerpt):
fr: Réponse JSON (extrait) :

source: empty
fr: vide

source: Columns:
fr: Colonnes :

source: number
fr: nombre

source: text
fr: texte

source: Example 2: OpenWeatherMap API
fr: Exemple 2 : API OpenWeatherMap

source: Example 3: GitHub API
fr: Exemple 3 : API GitHub

source: Help - Python Scripts for APIs
fr: Aide - Scripts Python pour les API

source: Guide for Python Scripts for APIs
fr: Guide des scripts Python pour les API

source: This page provides examples and best practices for creating Python scripts that retrieve data from APIs.
fr: Cette page fournit des exemples et des bonnes pratiques pour créer des scripts Python qui récupèrent des données depuis des API.

source: Handling Pagination
fr: Gestion de la pagination

source: Data Transformation
fr: Transformation des données

source: Basic Structure of a Python Script for API
fr: Structure de base d'un script Python pour API

source: Here is the basic structure of a Python script to retrieve data from an API:
fr: Voici la structure de base d'un script Python pour récupérer des données depuis une API :

source: Your code to retrieve data
fr: Votre code pour récupérer les données

source: Check if the request was successful
fr: Vérifier si la requête a réussi

source: Convert the response to JSON
fr: Convertir la réponse en JSON

source: Error:
fr: Erreur :

source: This function is automatically called by the system
fr: Cette fonction est automatiquement appelée par le système

source: Number of items retrieved:
fr: Nombre d'éléments récupérés :

source: Your script must always contain a <code>main()</code> function that returns the data as a list of objects.
fr: Votre script doit toujours contenir une fonction <code>main()</code> qui renvoie les données sous forme de liste d'objets.

source: Example of a script to retrieve data from the JSONPlaceholder API:
fr: Exemple de script pour récupérer des données de l'API JSONPlaceholder :

source: API URL
fr: URL de l'API

source: Make the GET request
fr: Effectuer la requête GET

source: An error occurred:
fr: Une erreur est survenue :

source: Number of articles retrieved:
fr: Nombre d'articles récupérés :

source: Example of a script for an API requiring an API key (like OpenWeatherMap):
fr: Exemple de script pour une API nécessitant une clé API (comme OpenWeatherMap) :

source: API Parameters
fr: Paramètres de l'API

source: Replace with your API key
fr: Remplacez par votre clé API

source: Request Parameters
fr: Paramètres de la requête

source: Make the GET request with parameters
fr: Effectuer la requête GET avec des paramètres

source: Transform the data to fit our format
fr: Transformer les données pour qu'elles correspondent à notre format

source: Weather in
fr: Météo à

source: Example of a script to retrieve paginated data (like The Movie Database API):
fr: Exemple de script pour récupérer des données paginées (comme l'API The Movie Database) :

source: Base Parameters
fr: Paramètres de base

source: API Error:
fr: Erreur API :

source: Extract the total number of pages and the results from the first page
fr: Extraire le nombre total de pages et les résultats de la première page

source: Limit to a maximum of 5 pages
fr: Limiter à un maximum de 5 pages

source: Total number of pages:
fr: Nombre total de pages :

source: Get the remaining pages
fr: Obtenir les pages restantes

source: API error for page
fr: Erreur API pour la page

source: retrieved,
fr: récupérée,

source: results
fr: résultats

source: Transform the data to get only the necessary information
fr: Transformer les données pour n'obtenir que les informations nécessaires

source: Error retrieving data:
fr: Erreur lors de la récupération des données :

source: Number of movies found:
fr: Nombre de films trouvés :

source: Example of a script with robust error handling:
fr: Exemple de script avec une gestion robuste des erreurs :

source: Logging configuration
fr: Configuration de la journalisation

source: seconds
fr: secondes

source: Attempt
fr: Tentative

source: 10-second timeout
fr: timeout de 10 secondes

source: Data retrieved successfully:
fr: Données récupérées avec succès :

source: items
fr: éléments

source: Request limit reached. Waiting for
fr: Limite de requêtes atteinte. Attente de

source: seconds.
fr: secondes.

source: HTTP Error:
fr: Erreur HTTP :

source: The request timed out
fr: La requête a expiré (timeout)

source: Connection error
fr: Erreur de connexion

source: Unexpected error:
fr: Erreur inattendue :

source: Example of a script with data transformation and filtering:
fr: Exemple de script avec transformation et filtrage des données :

source: Get posts for each user
fr: Obtenir les publications pour chaque utilisateur

source: Limit to 5 users for the example
fr: Limiter à 5 utilisateurs pour l'exemple

source: Filter and transform the data
fr: Filtrer et transformer les données

source: Truncate the content
fr: Tronquer le contenu

source: OAuth Authentication Parameters
fr: Paramètres d'authentification OAuth

source: your_client_key
fr: votre_cle_client

source: your_client_secret
fr: votre_secret_client

source: Create OAuth1 authentication
fr: Créer une authentification OAuth1

source: Authentication Parameters
fr: Paramètres d'authentification

source: Get the authentication token
fr: Obtenir le jeton d'authentification

source: Authentication error:
fr: Erreur d'authentification :

source: Use the token to access data
fr: Utiliser le jeton pour accéder aux données

source: General Information
fr: Informations générales

source: Security
fr: Sécurité

source: Public Access
fr: Accès public

source: Columns
fr: Colonnes

source: Add a column
fr: Ajouter une colonne

source: Edit
fr: Modifier

source: Edit
fr: Modifier

source: Update Type
fr: Type de mise à jour

source: Manual
fr: Manuelle

source: Automatic
fr: Automatique

source: You can add data manually or import a CSV/JSON file from the list management page.
fr: Vous pouvez ajouter des données manuellement ou importer un fichier CSV/JSON depuis la page de gestion de la liste.

source: Data Source
fr: Source de données

source: Remote URL
fr: URL distante

source: JSON configuration will be available after saving the list.
fr: La configuration JSON sera disponible après l'enregistrement de la liste.

source: Source URL
fr: URL de la source

source: Data Format
fr: Format des données

source: Choose the source file format (CSV or JSON)
fr: Choisissez le format du fichier source (CSV ou JSON)

source: Curl Command
fr: Commande Curl

source: See Curl command examples
fr: Voir les exemples de commandes Curl

source: Enter a complete curl command with necessary headers and options. The command will be executed as is.
fr: Entrez une commande curl complète avec les en-têtes et options nécessaires. La commande sera exécutée telle quelle.

source: Example:
fr: Exemple :

source: Source Code
fr: Code source

source: See Python script examples
fr: Voir les exemples de scripts Python

source: Your code here...
fr: Votre code ici...

source: Schedule (Cron)
fr: Planification (Cron)

source: Format: minute hour day month day_of_week (0 */1 * * *)
fr: Format : minute heure jour mois jour_de_semaine (0 */1 * * *)

source: Results Limit
fr: Limite de résultats

source: Maximum number of results to import (0 = no limit)
fr: Nombre maximal de résultats à importer (0 = sans limite)

source: Active list
fr: Liste active

source: Published list
fr: Liste publiée

source: Restrict access by IP address
fr: Restreindre l'accès par adresse IP

source: Allowed IP Addresses
fr: Adresses IP autorisées

source: Accepted formats: Individual IPs, CIDR ranges, or IP ranges. Separate entries with commas or semicolons.
fr: Formats acceptés : IP individuelles, plages CIDR, ou plages IP. Séparez les entrées par des virgules ou des points-virgules.

source: The options below allow you to generate public URLs to access the list's data without authentication. IP restrictions also apply to these accesses if enabled.
fr: Les options ci-dessous vous permettent de générer des URL publiques pour accéder aux données de la liste sans authentification. Les restrictions IP s'appliquent également à ces accès si elles sont activées.

source: Enable public access in CSV format
fr: Activer l'accès public au format CSV

source: Include headers in public CSV
fr: Inclure les en-têtes dans le CSV public

source: Enable public access in TXT format (single column)
fr: Activer l'accès public au format TXT (colonne unique)

source: Column to export
fr: Colonne à exporter

source: Include header in TXT file
fr: Inclure l'en-tête dans le fichier TXT

source: Enable public access in JSON format
fr: Activer l'accès public au format JSON

source: Action required:
fr: Action requise :

source: Click "Save" to generate the public access URLs.
fr: Cliquez sur "Enregistrer" pour générer les URL d'accès public.

source: Public Access URLs
fr: URL d'accès public

source: CSV URL:
fr: URL CSV :

source: URL generated after registration
fr: URL générée après enregistrement

source: TXT URL:
fr: URL TXT :

source: JSON URL:
fr: URL JSON :

source: Are you sure you want to delete the column
fr: Êtes-vous sûr de vouloir supprimer la colonne

source: Column name
fr: Nom de la colonne

source: Are you sure you want to delete all data from this list ? This action is irreversible.
fr: Êtes-vous sûr de vouloir supprimer toutes les données de cette liste ? Cette action est irréversible.

source: All data has been successfully deleted.
fr: Toutes les données ont été supprimées avec succès.

source: An error occurred while deleting data.
fr: Une erreur s'est produite lors de la suppression des données.

source: Delete All Data
fr: Supprimer toutes les données

source: Are you sure you want to delete this list? This action is irreversible.
fr: Êtes-vous sûr de vouloir supprimer cette liste ? Cette action est irréversible.

source: Delete List
fr: Supprimer la liste

source: Save
fr: Enregistrer

source: An error occurred while saving
fr: Une erreur s'est produite lors de l'enregistrement

source: Error details:
fr: Détails de l'erreur :

source: An error occurred while communicating with the server:
fr: Une erreur s'est produite lors de la communication avec le serveur :

source: this column
fr: cette colonne

source: rows deleted
fr: lignes supprimées

source: Deletion error
fr: Erreur de suppression

source: List deleted successfully
fr: Liste supprimée avec succès

source: An error occurred during deletion:
fr: Une erreur s'est produite lors de la suppression :
