Repository: Maneox/List-IQ
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: No rows selected
fr: Aucune ligne sélectionnée

source: Are you sure you want to delete %s row(s)?
fr: Êtes-vous sûr de vouloir supprimer %s ligne(s) ?

source: No valid row IDs found
fr: Aucun ID de ligne valide trouvé

source: Error: Missing CSRF token
fr: Erreur : Jeton CSRF manquant

source: Error: Missing list ID
fr: Erreur : ID de liste manquant

source: Deleting...
fr: Suppression en cours...

source: Delete selection
fr: Supprimer la sélection

source: %s row(s) deleted successfully
fr: %s ligne(s) supprimée(s) avec succès

source: No rows could be deleted
fr: Aucune ligne n'a pu être supprimée

source: Error during deletion:
fr: Erreur lors de la suppression :

source: Delete (%s)
fr: Supprimer (%s)

source: Importing...
fr: Import en cours...

source: Import
fr: Importer

source: Error during import
fr: Erreur lors de l'import

source: Adding...
fr: Ajout en cours...

source: Error during add (%s)
fr: Erreur lors de l'ajout (%s)

source: Invalid server response
fr: Réponse invalide du serveur

source: Error fetching row data
fr: Erreur lors de la récupération des données de la ligne

source: Row data is invalid
fr: Les données de la ligne sont invalides

source: Row added successfully
fr: Ligne ajoutée avec succès

source: Error during add
fr: Erreur lors de l'ajout

source: Add
fr: Ajouter

source: Error: List ID not found
fr: Erreur : ID de liste non trouvé

source: An error occurred while initializing the edit. See console for details.
fr: Une erreur est survenue lors de l'initialisation de la modification. Voir la console pour plus de détails.

source: Error while fetching row data
fr: Erreur lors de la récupération des données de la ligne

source: An error occurred while fetching the data. See console for details.
fr: Une erreur est survenue lors de la récupération des données. Voir la console pour plus de détails.

source: Updating...
fr: Mise à jour en cours...

source: Error during update
fr: Erreur lors de la mise à jour

source: Error fetching updated data
fr: Erreur lors de la récupération des données mises à jour

source: Row not found
fr: Ligne non trouvée

source: Update
fr: Mettre à jour

source: Row updated successfully
fr: Ligne mise à jour avec succès

source: Error while updating row. Please refresh the page.
fr: Erreur lors de la mise à jour de la ligne. Veuillez rafraîchir la page.

source: Are you sure you want to delete this row?
fr: Êtes-vous sûr de vouloir supprimer cette ligne ?

source: Error during deletion
fr: Erreur lors de la suppression

source: API Documentation
fr: Documentation de l'API

source: This page presents the interactive documentation for the List-IQ API. You can explore the available endpoints, their parameters, and test the requests directly from this interface.
fr: Cette page présente la documentation interactive de l'API de List-IQ. Vous pouvez explorer les points d'accès disponibles, leurs paramètres, et tester les requêtes directement depuis cette interface.

source: Some operations require administrator rights. See the "Access Restrictions" section for more information.
fr: Certaines opérations nécessitent des droits d'administrateur. Consultez la section "Restrictions d'accès" pour plus d'informations.

source: Postman Integration Guide
fr: Guide d'intégration Postman

source: Download OpenAPI File
fr: Télécharger le fichier OpenAPI

source: API Integration with Postman
fr: Intégration de l'API avec Postman

source: Back to API Documentation
fr: Retour à la documentation de l'API

source: Download Postman Collection
fr: Télécharger la collection Postman

source: Postman Configuration
fr: Configuration de Postman

source: Recommended Method: Direct Import of the Postman Collection
fr: Méthode recommandée : Importation directe de la collection Postman

source: We have prepared a ready-to-use Postman collection that works immediately:
fr: Nous avons préparé une collection Postman prête à l'emploi qui fonctionne immédiatement :

source: Open Postman
fr: Ouvrez Postman

source: Click "Import" in the upper left corner
fr: Cliquez sur "Import" en haut à gauche

source: Select the "Link" tab
fr: Sélectionnez l'onglet "Link"

source: Paste the following URL:
fr: Collez l'URL suivante :

source: Click "Import"
fr: Cliquez sur "Import"

source: Postman will import the complete collection with all configured endpoints
fr: Postman importera la collection complète avec tous les points d'accès configurés

source: Recommended:
fr: Recommandé :

source: This method is more reliable than OpenAPI import and includes request and response examples.
fr: Cette méthode est plus fiable que l'importation OpenAPI et inclut des exemples de requêtes et de réponses.

source: Alternative: OpenAPI Documentation Import
fr: Alternative : Importation de la documentation OpenAPI

source: Postman can also directly import the OpenAPI documentation:
fr: Postman peut également importer directement la documentation OpenAPI :

source: Select the "Link" tab and paste
fr: Sélectionnez l'onglet "Link" et collez

source: or use the "File" tab and import the file
fr: ou utilisez l'onglet "File" et importez le fichier

source: that you downloaded
fr: que vous avez téléchargé

source: Postman will generate a collection based on the OpenAPI specification
fr: Postman générera une collection basée sur la spécification OpenAPI

source: Importing via OpenAPI may sometimes fail to capture all the collection details.
fr: L'importation via OpenAPI peut parfois ne pas capturer tous les détails de la collection.

source: Environment Variables Configuration
fr: Configuration des variables d'environnement

source: To facilitate the use of the API, create an environment with the following variables:
fr: Pour faciliter l'utilisation de l'API, créez un environnement avec les variables suivantes :

source: Click the gear icon (⚙️) in the top right
fr: Cliquez sur l'icône d'engrenage (⚙️) en haut à droite

source: Select "Environments" then "Add"
fr: Sélectionnez "Environments" puis "Add"

source: Name your environment (e.g., "List-IQ - Local")
fr: Nommez votre environnement (ex: "List-IQ - Local")

source: Add the following variables:
fr: Ajoutez les variables suivantes :

source: API base URL (e.g.:
fr: URL de base de l'API (ex:

source: Your API token (without the "Bearer" prefix)
fr: Votre jeton d'API (sans le préfixe "Bearer")

source: ID of a list for testing (optional)
fr: ID d'une liste pour les tests (optionnel)

source: ID of a row for testing (optional)
fr: ID d'une ligne pour les tests (optionnel)

source: Click "Save"
fr: Cliquez sur "Enregistrer"

source: Select your environment from the dropdown menu in the top right
fr: Sélectionnez votre environnement dans le menu déroulant en haut à droite

source: Authentication Configuration
fr: Configuration de l'authentification

source: Configure token authentication for the entire collection:
fr: Configurez l'authentification par jeton pour toute la collection :

source: In the imported collection, click the three dots (⋮) next to the collection name
fr: Dans la collection importée, cliquez sur les trois points (⋮) à côté du nom de la collection

source: Select "Edit"
fr: Sélectionnez "Edit"

source: Go to the "Authorization" tab
fr: Allez dans l'onglet "Authorization"

source: Select the type "Bearer Token"
fr: Sélectionnez le type "Bearer Token"

source: In the "Token" field, enter <code>{{token}}</code> to use the environment variable
fr: Dans le champ "Token", entrez <code>{{token}}</code> pour utiliser la variable d'environnement

source: Click "Update"
fr: Cliquez sur "Mettre à jour"

source: API Usage
fr: Utilisation de l'API

source: Main Endpoints
fr: Points d'accès principaux

source: List Management
fr: Gestion des listes

source: Retrieve all accessible lists
fr: Récupérer toutes les listes accessibles

source: Retrieve details of a specific list
fr: Récupérer les détails d'une liste spécifique

source: Create a new list (admin only)
fr: Créer une nouvelle liste (admin seulement)

source: Update a list (admin only)
fr: Mettre à jour une liste (admin seulement)

source: Delete a list (admin only)
fr: Supprimer une liste (admin seulement)

source: Data Management
fr: Gestion des données

source: Retrieve all data from a list
fr: Récupérer toutes les données d'une liste

source: Retrieve a specific row
fr: Récupérer une ligne spécifique

source: Add a data row (admin only)
fr: Ajouter une ligne de données (admin seulement)

source: Update a row (admin only)
fr: Mettre à jour une ligne (admin seulement)

source: Delete a row (admin only)
fr: Supprimer une ligne (admin seulement)

source: In accordance with the project rules, list administration actions (creation, structure modification, column management) are only available via the web interface and not via the API.
fr: Conformément aux règles du projet, les actions d'administration des listes (création, modification de la structure, gestion des colonnes) ne sont disponibles que via l'interface web et non via l'API.

source: Request Examples
fr: Exemples de requêtes

source: Retrieve all lists
fr: Récupérer toutes les listes

source: Create a new URL CSV list (admin only)
fr: Créer une nouvelle liste CSV depuis une URL (admin seulement)

source: My URLCSVAPI List
fr: Ma Liste URLCSVAPI

source: Description of my CSV list imported from a URL
fr: Description de ma liste CSV importée depuis une URL

source: Name
fr: Nom

source: Age
fr: Âge

source: Troubleshooting
fr: Dépannage

source: Error 401 (Unauthenticated)
fr: Erreur 401 (Non authentifié)

source: Check that your API token is valid and has not expired
fr: Vérifiez que votre jeton d'API est valide et n'a pas expiré

source: Make sure the <code>token</code> environment variable is set correctly
fr: Assurez-vous que la variable d'environnement <code>token</code> est correctement définie

source: Check that Bearer Token authentication is configured at the collection level
fr: Vérifiez que l'authentification Bearer Token est configurée au niveau de la collection

source: Error 403 (Forbidden)
fr: Erreur 403 (Interdit)

source: Check that you have the necessary rights to perform the operation
fr: Vérifiez que vous disposez des droits nécessaires pour effectuer l'opération

source: For adding, modifying, and deleting data, you must have an administrator token
fr: Pour ajouter, modifier et supprimer des données, vous devez disposer d'un jeton administrateur

source: Error 404 (Not Found)
fr: Erreur 404 (Non trouvé)

source: Check that the list or row ID exists
fr: Vérifiez que l'ID de la liste ou de la ligne existe

source: Make sure the URL is formatted correctly
fr: Assurez-vous que l'URL est correctement formatée

source: Lists
fr: Listes

source: New List
fr: Nouvelle Liste

source: Help
fr: Aide

source: Automatic Lists Guide
fr: Guide des listes automatiques

source: Python Scripts
fr: Scripts Python

source: Curl Commands
fr: Commandes Curl

source: JSON Configuration
fr: Configuration JSON

source: Language
fr: Langue

source: French
fr: Français

source: English
fr: Anglais

source: Theme
fr: Thème

source: API Tokens
fr: Jetons d'API

source: User Management
fr: Gestion des utilisateurs

source: LDAP Configuration
fr: Configuration LDAP

source: Logout
fr: Déconnexion

source: Login
fr: Connexion

source: All rights reserved
fr: Tous droits réservés

source: Edit User
fr: Modifier l'utilisateur

source: Close
fr: Fermer

source: Username
fr: Nom d'utilisateur

source: New Password
fr: Nouveau mot de passe

source: (leave blank to not change)
fr: (laisser vide pour ne pas changer)

source: Administrator
fr: Administrateur

source: Active
fr: Actif

source: Cancel
fr: Annuler

source: Save Changes
fr: Enregistrer les modifications

source: LDAP/LDAPS Configuration
fr: Configuration LDAP/LDAPS

source: Configure the connection settings to your LDAP/Active Directory service to enable user authentication and authorization.
fr: Configurez les paramètres de connexion à votre service LDAP/Active Directory pour activer l'authentification et l'autorisation des utilisateurs.

source: Connection Settings
fr: Paramètres de connexion

source: Enable LDAP Authentication
fr: Activer l'authentification LDAP

source: LDAP Server
fr: Serveur LDAP

source: Hostname or IP address of the LDAP server
fr: Nom d'hôte ou adresse IP du serveur LDAP

source: Default port: 389 (LDAP) or 636 (LDAPS)
fr: Port par défaut : 389 (LDAP) ou 636 (LDAPS)

source: Use SSL (LDAPS)
fr: Utiliser SSL (LDAPS)

source: Use TLS (StartTLS)
fr: Utiliser TLS (StartTLS)

source: Verify SSL/TLS Certificate
fr: Vérifier le certificat SSL/TLS

source: Enable to verify the LDAP server certificate
fr: Activer pour vérifier le certificat du serveur LDAP

source: CA Certificate for SSL/TLS
fr: Certificat CA pour SSL/TLS

source: If you are using LDAPS or StartTLS with a certificate issued by a private PKI, you must provide the CA certificate in PEM format.
fr: Si vous utilisez LDAPS ou StartTLS avec un certificat émis par une PKI privée, vous devez fournir le certificat de l'autorité de certification (CA) au format PEM.

source: A CA certificate is currently configured.
fr: Un certificat CA est actuellement configuré.

source: Remove current CA certificate
fr: Supprimer le certificat CA actuel

source: CA Certificate (PEM format)
fr: Certificat CA (format PEM)

source: File containing the certificate in PEM format (starts with -----BEGIN CERTIFICATE-----)
fr: Fichier contenant le certificat au format PEM (commence par -----BEGIN CERTIFICATE-----)

source: Authentication Settings
fr: Paramètres d'authentification

source: DN of the service account used to connect to the LDAP server. For Active Directory, use the format: username@domain.com
fr: DN du compte de service utilisé pour se connecter au serveur LDAP. Pour Active Directory, utilisez le format : nomutilisateur@domaine.com

source: Bind Password
fr: Mot de passe du Bind

source: Password
fr: Mot de passe

source: Leave blank to keep the current password
fr: Laisser vide pour conserver le mot de passe actuel

source: Search Settings
fr: Paramètres de recherche

source: Base DN for all LDAP searches
fr: DN de base pour toutes les recherches LDAP

source: DN where users are searched (leave blank to use the base DN)
fr: DN où les utilisateurs sont recherchés (laisser vide pour utiliser le DN de base)

source: DN where groups are searched (leave blank to use the base DN)
fr: DN où les groupes sont recherchés (laisser vide pour utiliser le DN de base)

source: User RDN Attribute
fr: Attribut RDN Utilisateur

source: For AD: sAMAccountName
fr: Pour AD : sAMAccountName

source: Login Attribute
fr: Attribut de connexion

source: User Object Class
fr: Classe d'objet Utilisateur

source: For AD: person or user
fr: Pour AD : person ou user

source: Authorization Settings
fr: Paramètres d'autorisation

source: Users must belong to at least the user group to be able to log in. Administrators must belong to the administrator group.
fr: Les utilisateurs doivent appartenir au minimum au groupe utilisateur pour pouvoir se connecter. Les administrateurs doivent appartenir au groupe administrateur.

source: Administrator Group
fr: Groupe Administrateur

source: DN of the group whose members will have administrator rights
fr: DN du groupe dont les membres auront les droits d'administrateur

source: User Group
fr: Groupe Utilisateur

source: DN of the group whose members will have standard user rights
fr: DN du groupe dont les membres auront les droits d'utilisateur standard

source: Member Attribute
fr: Attribut de membre

source: For AD: member
fr: Pour AD : member

source: Group Object Class
fr: Classe d'objet Groupe

source: For AD: group
fr: Pour AD : group

source: Test Connection
fr: Tester la connexion

source: Save Configuration
fr: Enregistrer la configuration

source: Select a Group
fr: Sélectionner un groupe

source: Loading...
fr: Chargement...

source: Loading groups...
fr: Chargement des groupes...

source: Search for a group...
fr: Rechercher un groupe...

source: Testing...
fr: Test en cours...

source: Connection Successful
fr: Connexion réussie

source: Connection Failed
fr: Échec de la connexion

source: Error during connection test:
fr: Erreur lors du test de connexion :

source: Error
fr: Erreur

source: An error occurred during the connection test
fr: Une erreur est survenue lors du test de connexion

source: No groups found
fr: Aucun groupe trouvé

source: Error loading groups:
fr: Erreur lors du chargement des groupes :

source: An error occurred while loading groups
fr: Une erreur est survenue lors du chargement des groupes

source: New User
fr: Nouvel utilisateur

source: Create User
fr: Créer l'utilisateur

source: User Administration
fr: Administration des utilisateurs

source: Status
fr: Statut

source: Role
fr: Rôle

source: Last Login
fr: Dernière connexion

source: Inactive
fr: Inactif

source: User
fr: Utilisateur

source: Never
fr: Jamais

source: Manage your access tokens for the List-IQ API
fr: Gérez vos jetons d'accès pour l'API de List-IQ

source: New Token
fr: Nouveau Jeton

source: Your API Tokens
fr: Vos Jetons d'API

source: Created On
fr: Créé le

source: Expires On
fr: Expire le

source: Last Used
fr: Dernière utilisation

source: No expiration
fr: Pas d'expiration

source: Never used
fr: Jamais utilisé

source: Are you sure you want to revoke this token? This action is irreversible.
fr: Êtes-vous sûr de vouloir révoquer ce jeton ? Cette action est irréversible.

source: Revoke
fr: Révoquer

source: You have not created any API tokens yet.
fr: Vous n'avez pas encore créé de jeton d'API.

source: Create a token
fr: Créer un jeton

source: How to use your API tokens
fr: Comment utiliser vos jetons d'API

source: To use the List-IQ API with an authentication token, include the token in the <code>Authorization</code> header of your HTTP requests:
fr: Pour utiliser l'API List-IQ avec un jeton d'authentification, incluez le jeton dans l'en-tête <code>Authorization</code> de vos requêtes HTTP :

source: Example with cURL:
fr: Exemple avec cURL :

source: Example with Python:
fr: Exemple avec Python :

source: Headers with the authentication token
fr: En-têtes avec le jeton d'authentification

source: Example: get all lists
fr: Exemple : obtenir toutes les listes

source: Security Best Practices
fr: Bonnes pratiques de sécurité

source: Secure Storage
fr: Stockage sécurisé

source: Never store your API tokens in plaintext in your source code or in unsecured files.
fr: Ne stockez jamais vos jetons d'API en clair dans votre code source ou dans des fichiers non sécurisés.

source: Always use HTTPS in production to prevent token interception.
fr: Utilisez toujours HTTPS en production pour éviter l'interception des jetons.

source: Set an expiration date for sensitive tokens.
fr: Définissez une date d'expiration pour les jetons sensibles.

source: Regular Revocation
fr: Révocation régulière

source: Revoke and renew your API tokens regularly.
fr: Révoquez et renouvelez régulièrement vos jetons d'API.

source: Monitoring
fr: Surveillance

source: Monitor the usage of your tokens to detect any suspicious activity.
fr: Surveillez l'utilisation de vos jetons pour détecter toute activité suspecte.

source: Create a new API token
fr: Créer un nouveau jeton d'API

source: Token Name
fr: Nom du jeton

source: E.g.: Sync script
fr: Ex: Script de synchro

source: Give your token a descriptive name to easily identify it.
fr: Donnez un nom descriptif à votre jeton pour l'identifier facilement.

source: Expiration Date
fr: Date d'expiration

source: Leave blank for a token without an expiration date.
fr: Laissez vide pour un jeton sans date d'expiration.

source: Create Token
fr: Créer le jeton

source: Your New API Token
fr: Votre nouveau jeton d'API

source: Warning:
fr: Attention :

source: This token will only be displayed once. Copy it now and keep it in a safe place.
fr: Ce jeton ne sera affiché qu'une seule fois. Copiez-le maintenant et conservez-le en lieu sûr.

source: Security Token:
fr: Jeton de sécurité :

source: Copy
fr: Copier

source: Token copied to clipboard!
fr: Jeton copié dans le presse-papiers !

source: Created on:
fr: Créé le :

source: Expires on:
fr: Expire le :

source: How to use your API token
fr: Comment utiliser votre jeton d'API

source: To use the List-IQ API with this authentication token, include it in the <code>Authorization</code> header of your HTTP requests:
fr: Pour utiliser l'API List-IQ avec ce jeton d'authentification, incluez-le dans l'en-tête <code>Authorization</code> de vos requêtes HTTP :

source: your_token
fr: votre_jeton

source: For more information on how to use this token, see the "How to use your API tokens" section below.
fr: Pour plus d'informations sur l'utilisation de ce jeton, consultez la section "Comment utiliser vos jetons d'API" ci-dessous.

source: I have copied my token
fr: J'ai copié mon jeton

source: Creating...
fr: Création en cours...

source: Server error
fr: Erreur du serveur

source: Error creating token:
fr: Erreur lors de la création du jeton :

source: Copied!
fr: Copié !

source: Copy error. Please copy manually.
fr: Erreur de copie. Veuillez copier manuellement.

source: Invalid date
fr: Date invalide

source: Back to Token Management
fr: Retour à la gestion des jetons

source: Security Token
fr: Jeton de Sécurité

source: Your API token:
fr: Votre jeton d'API :

source: Use this token in the <code>Authorization: Bearer <token></code> header
fr: Utilisez ce jeton dans l'en-tête <code>Authorization: Bearer <jeton></code>

source: Error during copy. Please select manually.
fr: Erreur lors de la copie. Veuillez sélectionner manuellement.

source: Access Denied
fr: Accès Refusé

source: Redirecting...
fr: Redirection...

source: Contact the administrator.
fr: Contactez l'administrateur.

source: Back to Home
fr: Retour à l'accueil

source: Help - Automatic Lists
fr: Aide - Listes automatiques

source: Automatic Lists User Guide
fr: Guide d'utilisation des listes automatiques

source: This page explains how to configure and use automatic lists to retrieve data from various sources.
fr: Cette page explique comment configurer et utiliser les listes automatiques pour récupérer des données à partir de diverses sources.

source: Data Source Types
fr: Types de sources de données

source: Configuration with API Script
fr: Configuration avec un script API

source: Configuration with API Curl
fr: Configuration avec une commande API Curl

source: Configuration with URL
fr: Configuration avec une URL

source: Scheduling Updates
fr: Planification des mises à jour

source: The application supports several types of data sources for automatic lists:
fr: L'application prend en charge plusieurs types de sources de données pour les listes automatiques :

source: API Script
fr: Script API

source: Use a custom script (Python, JavaScript, etc.)
fr: Utiliser un script personnalisé (Python, JavaScript, etc.)

source: Use a curl command to retrieve data
fr: Utiliser une commande curl pour récupérer des données

source: Direct data retrieval from a URL (JSON or CSV)
fr: Récupération directe de données depuis une URL (JSON ou CSV)

source: This method allows you to use a custom script to retrieve and format data.
fr: Cette méthode vous permet d'utiliser un script personnalisé pour récupérer et formater les données.

source: Configuration Steps
fr: Étapes de configuration

source: Create a new list or edit an existing one
fr: Créez une nouvelle liste ou modifiez une liste existante

source: In the "Update Type" section, select "Automatic"
fr: Dans la section "Type de mise à jour", sélectionnez "Automatique"

source: In "Data Source", select "API"
fr: Dans "Source de données", sélectionnez "API"

source: In "API Type", select "Script"
fr: Dans "Type d'API", sélectionnez "Script"
